web/src/test/resources/integrationtests/revokemedicalcertificate/requests.stg

delimiters "$", "$"

request(intygsId, personId, meddelande) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:riv:insuranceprocess:healthreporting:RevokeMedicalCertificateResponder:1" xmlns:urn1="urn:riv:insuranceprocess:healthreporting:medcertqa:1" xmlns:urn2="urn:riv:insuranceprocess:healthreporting:2">
   <soapenv:Header>
      <add:To>fk</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:RevokeMedicalCertificateRequest>
         <urn:revoke>
            <urn:vardReferens-id>12345</urn:vardReferens-id>
            <urn:avsantTidpunkt>2016-01-01T06:34:54</urn:avsantTidpunkt>
            <urn:meddelande>$meddelande$</urn:meddelande>
            <urn:adressVard>
               <urn1:hosPersonal>
                  <urn2:personal-id root="1.2.752.129.2.1.4.1" extension="?"/>
                  <urn2:fullstandigtNamn>?</urn2:fullstandigtNamn>
                  <urn2:enhet>
                     <urn2:enhets-id root="1.2.752.129.2.1.4.1" extension="?"/>
                     <urn2:enhetsnamn>?</urn2:enhetsnamn>
                     <urn2:vardgivare>
                         <urn2:vardgivare-id root="1.2.752.129.2.1.4.1" extension="?"/>
                         <urn2:vardgivarnamn>Vardgivarnamn</urn2:vardgivarnamn>
                     </urn2:vardgivare>
                  </urn2:enhet>
               </urn1:hosPersonal>
            </urn:adressVard>
            <urn:lakarutlatande>
               <urn1:lakarutlatande-id>$intygsId$</urn1:lakarutlatande-id>
               <urn1:signeringsTidpunkt>2016-01-01T05:34:43</urn1:signeringsTidpunkt>
               <urn1:patient>
                  <urn2:person-id root="1.2.752.129.2.1.3.1" extension="$personId$"/>
                  <urn2:fullstandigtNamn>Patient Namn</urn2:fullstandigtNamn>
               </urn1:patient>
            </urn:lakarutlatande>
         </urn:revoke>
      </urn:RevokeMedicalCertificateRequest>
   </soapenv:Body>
</soapenv:Envelope>
>>

blankstegRequest(intygsId, personId, meddelande) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:riv:insuranceprocess:healthreporting:RevokeMedicalCertificateResponder:1" xmlns:urn1="urn:riv:insuranceprocess:healthreporting:medcertqa:1" xmlns:urn2="urn:riv:insuranceprocess:healthreporting:2">
   <soapenv:Header>
      <add:To>fk</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <RevokeMedicalCertificateRequest xmlns="urn:riv:insuranceprocess:healthreporting:RevokeMedicalCertificateResponder:1"
                                 xmlns:core="urn:riv:insuranceprocess:healthreporting:2"
                                 xmlns:qa="urn:riv:insuranceprocess:healthreporting:medcertqa:1">
  <revoke>
    <vardReferens-id> </vardReferens-id>
    <avsantTidpunkt>2011-03-23T09:29:15</avsantTidpunkt>
    <adressVard>
      <qa:hosPersonal>
        <core:personal-id root="1.2.752.129.2.1.4.1" extension=" "/>
        <core:fullstandigtNamn> </core:fullstandigtNamn>
        <core:enhet>
          <core:enhets-id root="1.2.752.129.2.1.4.1" extension=" "/>
          <core:arbetsplatskod root="1.2.752.29.4.71" extension=" "/>
          <core:enhetsnamn> </core:enhetsnamn>
          <core:vardgivare>
            <core:vardgivare-id root="1.2.752.129.2.1.4.1" extension=" "/>
            <core:vardgivarnamn> </core:vardgivarnamn>
          </core:vardgivare>
        </core:enhet>
      </qa:hosPersonal>
    </adressVard>
    <lakarutlatande xmlns="urn:riv:insuranceprocess:healthreporting:RevokeMedicalCertificateResponder:1">
      <qa:lakarutlatande-id>$intygsId$</qa:lakarutlatande-id>
      <qa:signeringsTidpunkt>2011-01-26T00:00:00</qa:signeringsTidpunkt>
      <qa:patient xmlns="urn:riv:insuranceprocess:healthreporting:2">
        <person-id root="1.2.752.129.2.1.3.1" extension="$personId$"/>
        <fullstandigtNamn> </fullstandigtNamn>
      </qa:patient>
    </lakarutlatande>
  </revoke>
</RevokeMedicalCertificateRequest>
   </soapenv:Body>
</soapenv:Envelope>
>>
